In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([10,77,12,4,5]);s

0    10
1    77
2    12
3     4
4     5
dtype: int64

In [3]:
10 in s

False

In [3]:
10 in s.values

True

In [4]:
s.values

array([10, 77, 12,  4,  5], dtype=int64)

In [12]:
s[s>10]

1    77
2    12
dtype: int64

In [4]:
import seaborn as sns
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [6]:
df[0:5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
df.iloc[0:5,0:5]

   survived  pclass     sex   age  sibsp
0         0       3    male  22.0      1
1         1       1  female  38.0      1
2         1       3  female  26.0      0
3         1       1  female  35.0      1
4         0       3    male  35.0      0

In [8]:
df.loc[0:5,]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
df.drop(0,axis=0)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [10]:
df.set_index("age",drop=True)

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
age,,,,,,,,,,,,,,
22.0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
38.0,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
26.0,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
35.0,1,1,female,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
35.0,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
19.0,1,1,female,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
NaN,0,3,female,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
26.0,1,1,male,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
32.0,0,3,male,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [11]:
df.set_index("age",drop=True).reset_index()

,age,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,22.0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,38.0,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,26.0,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,35.0,1,1,female,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,35.0,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,27.0,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,19.0,1,1,female,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,NaN,0,3,female,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,26.0,1,1,male,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,32.0,0,3,male,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [12]:
df["age"]**2

0       484.0
1      1444.0
2       676.0
3      1225.0
4      1225.0
        ...
886     729.0
887     361.0
888       NaN
889     676.0
890    1024.0
Name: age, Length: 891, dtype: float64

In [13]:
df.loc[:,df.columns.str.contains("age")]

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [14]:
df.columns.str.contains("age")

array([False, False, False,  True, False, False, False, False, False,
       False, False, False, False, False, False])

In [15]:
df.loc[:,~df.columns.str.contains("age")]

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [16]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
df.loc[1]

survived               1
pclass                 1
sex               female
age                 38.0
sibsp                  1
parch                  0
fare             71.2833
embarked               C
class              First
who                woman
adult_male         False
deck                   C
embark_town    Cherbourg
alive                yes
alone              False
Name: 1, dtype: object

In [18]:
df.iloc[1]

survived               1
pclass                 1
sex               female
age                 38.0
sibsp                  1
parch                  0
fare             71.2833
embarked               C
class              First
who                woman
adult_male         False
deck                   C
embark_town    Cherbourg
alive                yes
alone              False
Name: 1, dtype: object

In [19]:
df.iloc[0:3]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [20]:
df.iloc[0:3,0:3]

   survived  pclass     sex
0         0       3    male
1         1       1  female
2         1       3  female

In [21]:
df.loc[:3,["age","pclass"]]

    age  pclass
0  22.0       3
1  38.0       1
2  26.0       3
3  35.0       1

In [22]:
df[df["pclass"]==2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,1,2,female,27.0,1,0,13.8583,C,Second,woman,False,NaN,Cherbourg,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [23]:
df.loc[df["pclass"]==2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,1,2,female,27.0,1,0,13.8583,C,Second,woman,False,NaN,Cherbourg,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True

In [24]:
df.loc[df["pclass"]==3,["age","sex"]]

      age     sex
0    22.0    male
2    26.0  female
4    35.0    male
5     NaN    male
7     2.0    male
..    ...     ...
882  22.0  female
884  25.0    male
885  39.0  female
888   NaN  female
890  32.0    male

[491 rows x 2 columns]

In [11]:
df.age>50

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: age, Length: 891, dtype: bool

In [25]:
df[df.age>50].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False

In [26]:
df[df.age>50]["age"].count()

64

In [27]:
df.loc[df.age>50,"age"].count()

64

In [28]:
df.loc[df.age>50,["class","age"]].head()

     class   age
6    First  54.0
11   First  58.0
15  Second  55.0
33  Second  66.0
54   First  65.0

In [29]:
df.loc[((df["age"]>50) & (df["sex"]=="female")),["sibsp","pclass","sex"]].head()

     sibsp  pclass     sex
11       0       1  female
15       0       2  female
195      0       1  female
268      0       1  female
275      1       1  female

In [30]:
df.loc[(df.age>50) & (df.sex=="male"),["class","age","sex"]].head()

     class   age   sex
6    First  54.0  male
33  Second  66.0  male
54   First  65.0  male
94   Third  59.0  male
96   First  71.0  male

In [31]:
df.loc[(df.age>50) & (df.sex=="male") & (df.embark_town=="Southampton"),["class","age","sex","embark_town"]].head()

      class   age   sex  embark_town
6     First  54.0  male  Southampton
33   Second  66.0  male  Southampton
94    Third  59.0  male  Southampton
124   First  54.0  male  Southampton
150  Second  51.0  male  Southampton

In [32]:
df.loc[(df.age>50) 
       & (df.sex=="male") 
       & (df.embark_town=="Southampton"),
       ["class","age","sex","embark_town"]].head()

      class   age   sex  embark_town
6     First  54.0  male  Southampton
33   Second  66.0  male  Southampton
94    Third  59.0  male  Southampton
124   First  54.0  male  Southampton
150  Second  51.0  male  Southampton

In [33]:
df.loc[(df.age>50) 
       & (df.sex=="male") 
       & ((df.embark_town=="Southampton") | (df.embark_town=="Cherbourg")),
       ["class","age","sex","embark_town"]].head()

     class   age   sex  embark_town
6    First  54.0  male  Southampton
33  Second  66.0  male  Southampton
54   First  65.0  male    Cherbourg
94   Third  59.0  male  Southampton
96   First  71.0  male    Cherbourg

In [34]:
df.loc[((df.embark_town=="Southampton") | (df.embark_town=="Cherbourg"))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [35]:
df.loc[df.embark_town.isin(["Cherbourg","Southampton"])]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [13]:
df.loc[df.deck.isin(["C"])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
55,1,1,male,NaN,0,0,35.5000,S,First,man,True,C,Southampton,yes,True

In [15]:
df.loc[df.deck.str.contains("C",na=False)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
55,1,1,male,NaN,0,0,35.5000,S,First,man,True,C,Southampton,yes,True

In [5]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
df.loc[df.embarked.str.contains("C",na=False)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True

In [37]:
df.groupby("sex")[["age"]].mean()

              age
sex
female  27.915709
male    30.726645

In [38]:
df.groupby("sex").agg({"age":["mean","max"]})

              age
             mean   max
sex
female  27.915709  63.0
male    30.726645  80.0

In [39]:
df.groupby("sex").agg({"age":["mean","max"],
                       "survived":"count"})

              age       survived
             mean   max    count
sex
female  27.915709  63.0      314
male    30.726645  80.0      577

In [40]:
df.groupby("sex").agg({"age":["mean","max"],
                       "survived":["mean","count"]})

              age        survived
             mean   max      mean count
sex
female  27.915709  63.0  0.742038   314
male    30.726645  80.0  0.188908   577

In [41]:
df.groupby(["sex","embark_town"]).agg({"age":["mean","max"],
                       "survived":["mean","count"]})

                          age        survived
                         mean   max      mean count
sex    embark_town
female Cherbourg    28.344262  60.0  0.876712    73
       Queenstown   24.291667  39.0  0.750000    36
       Southampton  27.771505  63.0  0.689655   203
male   Cherbourg    32.998841  71.0  0.305263    95
       Queenstown   30.937500  70.5  0.073171    41
       Southampton  30.291440  80.0  0.174603   441

In [42]:
df2=df.groupby(["sex","embark_town","class"]).agg({"age":["mean","max"],
                       "survived":["mean","count"]});df2

                                 age        survived
                                mean   max      mean count
sex    embark_town class
female Cherbourg   First   36.052632  60.0  0.976744    43
                   Second  19.142857  28.0  1.000000     7
                   Third   14.062500  45.0  0.652174    23
       Queenstown  First   33.000000  33.0  1.000000     1
                   Second  30.000000  30.0  1.000000     2
                   Third   22.850000  39.0  0.727273    33
       Southampton First   32.704545  63.0  0.958333    48
                   Second  29.719697  57.0  0.910448    67
                   Third   23.223684  63.0  0.375000    88
male   Cherbourg   First   40.111111  71.0  0.404762    42
                   Second  25.937500  36.0  0.200000    10
                   Third   25.016800  45.5  0.232558    43
       Queenstown  First   44.000000  44.0  0.000000     1
                   Second  57.000000  57.0  0.000000     1
                   Third   28.142857  70.5  0.076923    39
       Southampton First   41.897188  80.0  0.354430    79
                   Second  30.875889  70.0  0.154639    97
                   Third   26.574766  74.0  0.128302   265

In [43]:
df2.loc["male","Southampton",:]

              age        survived
             mean   max      mean count
class
First   41.897188  80.0  0.354430    79
Second  30.875889  70.0  0.154639    97
Third   26.574766  74.0  0.128302   265

In [44]:
df2.loc["female","Cherbourg",:]

              age        survived
             mean   max      mean count
class
First   36.052632  60.0  0.976744    43
Second  19.142857  28.0  1.000000     7
Third   14.062500  45.0  0.652174    23

In [45]:
idx = pd.IndexSlice

In [46]:
df2.loc[idx["female","Cherbourg"],idx["age","mean"]]

class
First     36.052632
Second    19.142857
Third     14.062500
Name: (age, mean), dtype: float64

In [47]:
df.groupby(["sex","embark_town","class"]).agg({"age":["mean"],
                       "survived":["mean","count"],
                       "sex":"count"})

                                 age  survived         sex
                                mean      mean count count
sex    embark_town class
female Cherbourg   First   36.052632  0.976744    43    43
                   Second  19.142857  1.000000     7     7
                   Third   14.062500  0.652174    23    23
       Queenstown  First   33.000000  1.000000     1     1
                   Second  30.000000  1.000000     2     2
                   Third   22.850000  0.727273    33    33
       Southampton First   32.704545  0.958333    48    48
                   Second  29.719697  0.910448    67    67
                   Third   23.223684  0.375000    88    88
male   Cherbourg   First   40.111111  0.404762    42    42
                   Second  25.937500  0.200000    10    10
                   Third   25.016800  0.232558    43    43
       Queenstown  First   44.000000  0.000000     1     1
                   Second  57.000000  0.000000     1     1
                   Third   28.142857  0.076923    39    39
       Southampton First   41.897188  0.354430    79    79
                   Second  30.875889  0.154639    97    97
                   Third   26.574766  0.128302   265   265

In [48]:
df.groupby("sex").age.mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [49]:
a=df.groupby("sex").agg({"age":["mean","count"]})
a

              age
             mean count
sex
female  27.915709   261
male    30.726645   453

In [50]:
a[("age","mean")] / a[("age","count")]

sex
female    0.106957
male      0.067829
dtype: float64

In [51]:
df.pivot_table(index="sex",values="survived",aggfunc=["mean","count"])

            mean    count
        survived survived
sex
female  0.742038      314
male    0.188908      577

In [16]:
df.age.isnull().sum()

177

In [18]:
df.groupby("sex").agg({"age":["mean","count"],
                       "sex":["count"]})

              age         sex
             mean count count
sex
female  27.915709   261   314
male    30.726645   453   577

In [42]:
df.pivot_table(index="sex",values="age",aggfunc=["mean","count"])

             mean count
              age   age
sex
female  27.915709   261
male    30.726645   453

In [43]:
df.pivot_table(values="survived",index="sex",columns=["embarked","class"],aggfunc=["mean"])

              mean
embarked         C                      Q                          S
class        First Second     Third First Second     Third     First
sex
female    0.976744    1.0  0.652174   1.0    1.0  0.727273  0.958333  \
male      0.404762    0.2  0.232558   0.0    0.0  0.076923  0.354430


embarked
class       Second     Third
sex
female    0.910448  0.375000
male      0.154639  0.128302

In [20]:
df["new_age"] = pd.cut(df["age"],[0,10,18,25,40,90],include_lowest=True)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,"(18.0, 25.0]"
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,"(25.0, 40.0]"
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,"(25.0, 40.0]"
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,"(25.0, 40.0]"
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,"(25.0, 40.0]"

In [21]:
df.pivot_table(index="sex",columns="new_age",values="survived")

new_age,"(-0.001, 10.0]","(10.0, 18.0]","(18.0, 25.0]","(25.0, 40.0]","(40.0, 90.0]"
sex,,,,,
female,0.612903,0.729730,0.759259,0.802198,0.770833
male,0.575758,0.131579,0.120370,0.220930,0.176471

In [65]:
str(df["new_age"]) + "_" + df["sex"]

0      0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
1      0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
2      0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
3      0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
4      0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
                             ...
886    0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
887    0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
888    0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
889    0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
890    0      (18.0, 25.0]\n1      (25.0, 40.0]\n2   ...
Name: sex, Length: 891, dtype: object

In [66]:
df["new_age"].astype(str) + "_" + df["sex"]

0        (18, 25]_male
1      (25, 40]_female
2      (25, 40]_female
3      (25, 40]_female
4        (25, 40]_male
            ...
886      (25, 40]_male
887    (18, 25]_female
888         nan_female
889      (25, 40]_male
890      (25, 40]_male
Length: 891, dtype: object

In [67]:
df.pivot_table(values="survived",index="sex",columns=["new_age"],aggfunc=["mean"])

             mean
new_age   (0, 10]  (10, 18]  (18, 25]  (25, 40]  (40, 90]
sex
female   0.612903  0.729730  0.759259  0.802198  0.770833
male     0.575758  0.131579  0.120370  0.220930  0.176471

In [68]:
df.pivot_table(values="survived",columns=["new_age"],aggfunc=["mean"])

             mean
new_age   (0, 10]  (10, 18]  (18, 25]  (25, 40]  (40, 90]
survived  0.59375  0.426667  0.333333  0.422053  0.366667

In [69]:
pd.crosstab(df.new_age,df.survived)

survived    0    1
new_age
(0, 10]    26   38
(10, 18]   43   32
(18, 25]  108   54
(25, 40]  152  111
(40, 90]   95   55

In [70]:
df["age_gender"] =df['new_age'].astype(str) + "_" + df['sex']

In [71]:
df.groupby("age_gender").survived.mean()

age_gender
(0, 10]_female     0.612903
(0, 10]_male       0.575758
(10, 18]_female    0.729730
(10, 18]_male      0.131579
(18, 25]_female    0.759259
(18, 25]_male      0.120370
(25, 40]_female    0.802198
(25, 40]_male      0.220930
(40, 90]_female    0.770833
(40, 90]_male      0.176471
nan_female         0.679245
nan_male           0.129032
Name: survived, dtype: float64

In [72]:
df.pivot_table(values="survived",index="sex",columns=["class"],aggfunc=["mean"])

            mean
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [82]:
df["class"].astype(str) + "_" + df["sex"].astype(str)

0        Third_male
1      First_female
2      Third_female
3      First_female
4        Third_male
           ...
886     Second_male
887    First_female
888    Third_female
889      First_male
890      Third_male
Length: 891, dtype: object

In [51]:
df.pivot_table(values="survived",columns=["class"],aggfunc=["mean"])

             mean
class       First    Second     Third
survived  0.62963  0.472826  0.242363

In [75]:
df["class_gender"] = df["class"].astype(str) + "_" + df["sex"]

In [76]:
df.pivot_table(values="survived",columns=["class_gender"],aggfunc=["mean"])

                     mean
class_gender First_female First_male Second_female Second_male Third_female
survived         0.968085   0.368852      0.921053    0.157407          0.5  \


class_gender Third_male
survived       0.135447

In [77]:
df.class_gender.value_counts()

class_gender
Third_male       347
Third_female     144
First_male       122
Second_male      108
First_female      94
Second_female     76
Name: count, dtype: int64

In [78]:
pd.crosstab(df.class_gender,df.survived)

survived         0   1
class_gender
First_female     3  91
First_male      77  45
Second_female    6  70
Second_male     91  17
Third_female    72  72
Third_male     300  47

In [83]:
df.pivot_table(values="survived",columns=["embark_town"],aggfunc=["mean"])

                 mean
embark_town Cherbourg Queenstown Southampton
survived     0.553571    0.38961    0.336957

In [84]:
df.pivot_table(values="survived",columns=["embark_town"],index="sex",aggfunc=["mean","count"])

                 mean                            count
embark_town Cherbourg Queenstown Southampton Cherbourg Queenstown Southampton
sex
female       0.876712   0.750000    0.689655        73         36         203
male         0.305263   0.073171    0.174603        95         41         441

In [88]:
df["embark_town_sex"] =df["embark_town"].astype(str) + "_" + df["sex"]

In [90]:
df.pivot_table(values="survived",columns="embark_town_sex",aggfunc=["mean"])

                            mean
embark_town_sex Cherbourg_female Cherbourg_male Queenstown_female
survived                0.876712       0.305263              0.75  \


embark_town_sex Queenstown_male Southampton_female Southampton_male nan_female
survived               0.073171           0.689655         0.174603        1.0

In [22]:
df["age2"] = df["age"]*2
df["age3"] = df["age"]*5
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age,age2,age3
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,"(18.0, 25.0]",44.0,110.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,"(25.0, 40.0]",76.0,190.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,"(25.0, 40.0]",52.0,130.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,"(25.0, 40.0]",70.0,175.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,"(25.0, 40.0]",70.0,175.0

In [92]:
df.drop(["new_age","age_gender"],axis=1,inplace=True)

In [93]:
for col in df.columns:
    if "age" in col:
        df[col] = df[col] / 10

In [95]:
df[["age","age2","age3"]].apply(lambda x:x*2)

     age  age2  age3
0    4.4   8.8  22.0
1    7.6  15.2  38.0
2    5.2  10.4  26.0
3    7.0  14.0  35.0
4    7.0  14.0  35.0
..   ...   ...   ...
886  5.4  10.8  27.0
887  3.8   7.6  19.0
888  NaN   NaN   NaN
889  5.2  10.4  26.0
890  6.4  12.8  32.0

[891 rows x 3 columns]

In [97]:
df[["age","age2","age3"]].agg(lambda x:x*2)

     age  age2  age3
0    4.4   8.8  22.0
1    7.6  15.2  38.0
2    5.2  10.4  26.0
3    7.0  14.0  35.0
4    7.0  14.0  35.0
..   ...   ...   ...
886  5.4  10.8  27.0
887  3.8   7.6  19.0
888  NaN   NaN   NaN
889  5.2  10.4  26.0
890  6.4  12.8  32.0

[891 rows x 3 columns]

In [99]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:x*2)

     age  age2  age3
0    4.4   8.8  22.0
1    7.6  15.2  38.0
2    5.2  10.4  26.0
3    7.0  14.0  35.0
4    7.0  14.0  35.0
..   ...   ...   ...
886  5.4  10.8  27.0
887  3.8   7.6  19.0
888  NaN   NaN   NaN
889  5.2  10.4  26.0
890  6.4  12.8  32.0

[891 rows x 3 columns]

In [74]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:x*2)

     age  age2  age3
0    4.4   8.8  22.0
1    7.6  15.2  38.0
2    5.2  10.4  26.0
3    7.0  14.0  35.0
4    7.0  14.0  35.0
..   ...   ...   ...
886  5.4  10.8  27.0
887  3.8   7.6  19.0
888  NaN   NaN   NaN
889  5.2  10.4  26.0
890  6.4  12.8  32.0

[891 rows x 3 columns]

In [24]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:x)

      age       new_age  age2   age3
0    22.0  (18.0, 25.0]  44.0  110.0
1    38.0  (25.0, 40.0]  76.0  190.0
2    26.0  (25.0, 40.0]  52.0  130.0
3    35.0  (25.0, 40.0]  70.0  175.0
4    35.0  (25.0, 40.0]  70.0  175.0
..    ...           ...   ...    ...
886  27.0  (25.0, 40.0]  54.0  135.0
887  19.0  (18.0, 25.0]  38.0   95.0
888   NaN           NaN   NaN    NaN
889  26.0  (25.0, 40.0]  52.0  130.0
890  32.0  (25.0, 40.0]  64.0  160.0

[891 rows x 4 columns]

In [23]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:print(x))

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64
0      (18.0, 25.0]
1      (25.0, 40.0]
2      (25.0, 40.0]
3      (25.0, 40.0]
4      (25.0, 40.0]
           ...
886    (25.0, 40.0]
887    (18.0, 25.0]
888             NaN
889    (25.0, 40.0]
890    (25.0, 40.0]
Name: new_age, Length: 891, dtype: category
Categories (5, interval[float64, right]): [(-0.001, 10.0] < (10.0, 18.0] < (18.0, 25.0] < (25.0, 40.0] < (40.0, 90.0]]
0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: age2, Length: 891, dtype: float64
0      110.0
1      190.0
2      130.0
3      175.0
4      175.0
       ...
886    135.0
887     95.0
888      NaN
889    130.0
890    160.0
Name: age3, Length: 891, dtype: float64

age        None
new_age    None
age2       None
age3       None
dtype: object

In [75]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:x.mean())

age      2.969912
age2     5.939824
age3    14.849559
dtype: float64

In [76]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:x-x.mean())

          age      age2      age3
0   -0.769912 -1.539824 -3.849559
1    0.830088  1.660176  4.150441
2   -0.369912 -0.739824 -1.849559
3    0.530088  1.060176  2.650441
4    0.530088  1.060176  2.650441
..        ...       ...       ...
886 -0.269912 -0.539824 -1.349559
887 -1.069912 -2.139824 -5.349559
888       NaN       NaN       NaN
889 -0.369912 -0.739824 -1.849559
890  0.230088  0.460176  1.150441

[891 rows x 3 columns]

In [77]:
df.loc[:,df.columns.str.contains("age")].apply(lambda x:x.max())

age      8.0
age2    16.0
age3    40.0
dtype: float64

In [78]:
def stnd(x):
    return (x-x.mean()) / x.std()

df.loc[:,df.columns.str.contains("age")].apply(stnd)

          age      age2      age3
0   -0.530005 -0.530005 -0.530005
1    0.571430  0.571430  0.571430
2   -0.254646 -0.254646 -0.254646
3    0.364911  0.364911  0.364911
4    0.364911  0.364911  0.364911
..        ...       ...       ...
886 -0.185807 -0.185807 -0.185807
887 -0.736524 -0.736524 -0.736524
888       NaN       NaN       NaN
889 -0.254646 -0.254646 -0.254646
890  0.158392  0.158392  0.158392

[891 rows x 3 columns]